import emoji
name = '嘉然'


def Asoul简介():
    print('''认真讲解就是这个虚拟主播团体背后资本是乐华，王一博就是这家公司的，当初这团体进场霹雳霹雳都在评论区骂，说真正的饭圈要来了，v吧泥哥各种成分都有，结果一出道小姑娘们心地善良看不懂弹幕评论区妖魔鬼怪还试图理解互动，加上主播超高质量3d优秀的节目效果让v吧人一瞬投降表示这就是我想要的虚拟主播，形成了粉丝的基本盘
但你要知道，基本盘是TM的贴吧老哥组成的，老哥们四处引流把什么地方的人都给引过来了，引的最纯的就是动物园的人，所以这个评论区属于是网络文化聚集地，大伙都不会好好说话，用独特的网络文化表达自己的感情，你以为他们阴阳怪气，他们只是发情都发不会而已
在了解一定程度的网络文化的情况下，asoul成员的评论区可以说是全虚拟主播界最有乐趣的地方
觉得行的话，可以给小姐姐们点个关注吗
乃琳Queen
https://space.bilibili.com/672342685/
珈乐Carol
https://space.bilibili.com/351609538/
贝拉kira
https://space.bilibili.com/672353429/
嘉然今天吃什么
https://space.bilibili.com/672328094/
向晚大魔王https://space.bilibili.com/672346917/​''')


def 嘉心糖论():
    print('如果有10%的新人关注，嘉心糖就会保证到处引流；有20%的新人关注，嘉心糖就能活跃起来；有50%的新人关注，嘉心糖就会铤而走险；为了100%的新人关注，嘉心糖就敢践踏一切人间法律；有300%以上的新人关注，嘉心糖就敢犯任何罪行，甚至去冒绞首的危险。--马丁《嘉心糖论》')
    i = input('''
        a.🤤🤤🤤🤤🤤🤤​
        b.🏳️🏳️​
        c.我擦我不好说
        d.我还有其他想法
        e.我没有想法
        请选择您的读后感：​''')
    if i == 'a':
        for _ in range(6):
            print(emoji.emojize(':sweat_smile:', use_aliases=True), end='')
    if i == 'e':
        print('你再想想！'+emoji.emojize(':imp:', use_aliases=True))
    if i == 'c':
        print('没啥好说的 错了就认 挨打就站好 但是没做过的事情绝对不认 第一次做教练就是在ksg 没在这里组织过一场假赛 跟假赛有关的就是在没做教练之前 有朋友问我认不认识选手 帮他聊选手推个微信 一个1000块 尝试去问了几个选手之后也没了下文 赌赛上面的任何处罚我都认 确实以前自己看比赛的时候下注了 但是假赛上面我没参与过什么 就那次想以帮别人推微信获利 而且还失败了 这个处罚结果我说实话接受不了 这几天会整理一下申诉 想喷随便喷 但是我只说一句 我绝对没有在ksg教唆任何人打假 或者组织打假')
    if i == 'd':
        print('''和国玉一起睡真的舒服 真的太太太凉快啦 女生好像都比男生身体要凉快许多 我比较怕热 每次我都会抱着她凉快 然后她会一直搂着我
还有就是嘉然睡觉其实睡的很死 她一直都是抱着我睡 只要我翻个身或者轻轻叫她 她马上就会醒来然后紧紧抱住我说“老公 怎么了”
每一次睡醒之后 嘉然喜欢赖床 她就会抱着我然后把头伸过来在我胸口上撒娇 早上起来那种奶声奶气地说“老公 我好想一直这样抱着你”
和嘉然一起睡真的好甜～枕头都变得更软 空气也变得好软 就连做的梦也是好柔软''')
    if i == 'b':
        print('你真是个啥b')
    else:
        print(''''对此回答表示严重关切，并发表三点看法
第一，当前一个魂关系处于一个重要关口，我们对发表正常二创视频没有意见，但视频应有助于增进一个魂相互理解与信任，有利于as和平稳定，不应如此啥比全麻。
第二，嘉心糖在重大问题上的立场是一贯的，明确的，我们捍卫嘉然身体健康不受麻醉的决心和意志坚如磐石。
第三，我麻麻得编不下去了，口水娃都👏了''')
    print('''
          收到收到收到
          晚安捏''')
